cmsis-svd/cmsis-svd/data/Nuvoton/NUC121AE_v1.svd
       <register>
          <name>SYS_IRCTISTS</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SYS_IRCTISTS</displayName>
          <description>HIRC Trim Interrupt Status Register</description>
          <addressOffset>0x88</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FREQLOCK</name>
              <description>HIRC Frequency Lock Status\nThis bit indicates the HIRC frequency is locked.\nThis is a status bit and doesn't trigger any interrupt.\nWrite 1 to clear this to 0. This bit will be set automatically, if the frequecy is lock and the RC_TRIM is enabled.\n</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>The internal high-speed RC oscillator 1 frequency doesn't lock at 48 MHz yet</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The internal high-speed RC oscillator 1 frequency locked at 48 MHz</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>TFAILIF</name>
              <description>HIRC Trim Failure Interrupt Status\nThis bit indicates that HIRC trim value update limitation count reached and the HIRC clock frequency still doesn't be locked. Once this bit is set, the auto trim operation stopped and FREQSEL(SYS_iRCTCTL[1:0]) will be cleared to 00 by hardware automatically.\nIf this bit is set and TFAILIEN(SYS_IRCTIEN1[1]) is high, an interrupt will be triggered to notify that HIRC trim value update limitation count was reached. Write 1 to clear this to 0.\n</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>HIRC trim value update limitation count does not reach</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>HIRC trim value update limitation count reached and frequency still not locked</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>CLKERRIF</name>
              <description>HIRC Clock Error Interrupt Status\nWhen the frequency of SOF or 48 MHz internal high speed RC oscillator (HIRC) is shift larger to unreasonable value, this bit will be set and to be an indicate that clock frequency is inaccuracy\nOnce this bit is set to 1, the auto trim operation stopped and FREQSEL(SYS_IRCTCL[1:0]) will be cleared to 00 by hardware automatically if CESTOPEN(SYS_IRCTCTL[8]) is set to 1.\nIf this bit is set and CLKEIEN(SYS_IRCTIEN1[2]) is high, an interrupt will be triggered to notify the clock frequency is inaccuracy. Write 1 to clear this to 0.\n</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>HIRC Clock frequency is accuracy</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>HIRC Clock frequency is inaccuracy</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>SYS_MODCTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SYS_MODCTL</displayName>
          <description>Modulation Control Register</description>
          <addressOffset>0xC0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MODEN</name>
              <description>Modulation Function Enable Bit\nThis bit enables modulation funcion by modulating with BPWM2 channel output and USCI0(USCI0_DAT0) or UART0(UART0_TXD) output.\n</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Modulation Function Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Modulation Function Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>MODH</name>
              <description>Modulation at Data High\nSelect modulation pulse(BPWM2) at UART0_TXD high or low\n0: Modulation pulse at UART0_TXD or USCI0_DAT0 low.\n1: Modulation pulse at UART0_TXD or USCI0_DAT0 high.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MODPWMSEL</name>
              <description>BPWM2 Channel Select for Modulation\nSelect the BPWM2 channel to modulate with the UART0_TXD or USCI0_DAT0.\n0000: BPWM2 Channel 0 modulate with UART0_TXD.\n0001: BPWM2 Channel 1 modulate with UART0_TXD.\n0010: BPWM2 Channel 2 modulate with UART0_TXD.\n0011: BPWM2 Channel 3 modulete with UART0_TXD.\n0100: BPWM2 Channel 4 modulete with UART0_TXD.\n0101: BPWM2 Channel 5 modulete with UART0_TXD.\n0110: Reserved.\n0111: Reserved.\n1000: BPWM2 Channel 0 modulate with USCI0_DAT0.\n1001: BPWM2 Channel 1 modulate with USCI0_DAT0.\n1010: BPWM2 Channel 2 modulate with USCI0_DAT0.\n1011: BPWM2 Channel 3 modulete with USCI0_DAT0.\n1100: BPWM2 Channel 4 modulete with USCI0_DAT0.\n1101: BPWM2 Channel 5 modulete with USCI0_DAT0.\n1110: Reserved.\n1111: Reserved.\nNote: This bis is valid while MODEN (SYS_MODCTL[0]) is set to 1.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>SYS_REGLCTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SYS_REGLCTL</displayName>
          <description>Register Lock Control Register</description>
          <addressOffset>0x100</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REGLCTL</name>
              <description>Register Lock Control Code (Write)\nSome registers have write-protection function. Writing these registers have to disable the protected function by writing the sequence value "59h", "16h", "88h" to this field. After this sequence is completed, the REGLCTL bit will be set to 1 and write-protection registers can be normal write.\nRegister Lock Control Disable Index (Read)\nThe Protected registers are:\nSYS_IPRST0: address 0x5000_0008\nSYS_BODCTL: address 0x5000_0018\nSYS_PORCTL: address 0x5000_0024\nSYS_TSOFFSET: address 0x5000_0114\nCLK_PWRCTL: address 0x5000_0200 (bit[6] is not protected for power-down wake-up interrupt clear)\nCLK_APBCLK0 [0]: address 0x5000_0208 (bit[0] is watchdog clock enable)\nCLK_CLKSEL0: address 0x5000_0210 (for HCLK and CPU STCLK clock source select)\nCLK_CLKSEL1 [1:0]: address 0x5000_0214 (for watchdog clock source select)\nCLK_CLKSEL3 [8]: address 0x5000_0234 (for USBD clock source select)\nCLK_CLKDSTS: address 0x5000_0274\nFMC_ISPCTL: address 0x4000_C000 (Flash ISP Control register)\nFMC_ISPTRG: address 0x4000_C010 (ISP Trigger Control register)\nFMC_ISPSTS: address 0x4000_C040\nWDT_CTL: address 0x4000_4000\nWDT_ALTCTL: address 0x4000_4004\nFMC_FTCTL: address 0x4000_5018\nFMC_ICPCMD: address 0x4000_501C\nEADC_TEST: address 0x4004_3200\nAHBMCTL: address 0x40000400\nCLK_PLLCTL: address 0x40000240\nPWM_CTL0: address 0x4005_8000 \nPWM_CTL0: address 0x4005_9000\nPWM_DTCTL0_1: address 0x4005_8070\nPWM_DTCTL0_1: address 0x4005_9070\nPWM_DTCTL2_3: address 0x4005_8074\nPWM_DTCTL2_3: address 0x4005_9074\nPWM_DTCTL4_5: address 0x4005_8078\nPWM_DTCTL4_5: address 0x4005_9078\nPWM_BRKCTL0_1: address 0x4005_80C8\nPWM_BRKCTL0_1: address 0x4005_90C8\nPWM_BRKCTL2_3: address 0x4005_80CC\nPWM_BRKCTL2_3: address 0x4005_90CC\nPWM_BRKCTL4_5: address 0x4005_80D0\nPWM_BRKCTL4_5: address 0x4005_90D0\nPWM_INTEN1: address 0x4005_80E4\nPWM_INTEN1: address 0x4005_90E4\nPWM_INTSTS1: address 0x4005_80EC\nPWM_INTSTS1: address 0x4005_90EC\nPWM_SELFTEST: address 0x4005_8300\nPWM_SELFTEST: address 0x4005_9300</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Write-protection Enabled for writing protected registers. Any write to the protected register is ignored</description>
                    <value>0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Write-protection Disabled for writing protected registers</description>
                    <value>1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>SYS_TSOFFSET</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SYS_TSOFFSET</displayName>
          <description>Temperature Sensor Offset Register</description>
          <addressOffset>0x114</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFF000</resetMask>
          <fields>
            <field>
              <name>VTEMP</name>
              <description>Temperature Sensor Offset Value \nThis field reflects temperature sensor output voltage offset at 25oC.\nBased on this value, with the value of temperature sensor output obtained from ADC conversion result and temperature sensor characteristics, it's easily to get temperature result by roughly calculation.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
